# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip_addr = input()
ip, mask = ip_addr.split('/')
oct1,oct2,oct3,oct4 = list(map(int,ip.split('.')))
mask_bytes = "1" * int(mask) + "0" * (32-int(mask))
mask1,mask2,mask3,mask4 = int(mask_bytes[:8],2), int(mask_bytes[8:16],2), int(mask_bytes[16:24],2), int(mask_bytes[24:32],2)
print(f'''Network:
{oct1:<8}  {oct2:<8}  {oct3:<8}  {oct4:<8}
{oct1:08b}  {oct2:08b}  {oct3:08b}  {oct4:08b}

Mask
/{mask}
{mask1:<8}  {mask2:<8}  {mask3:<8}  {mask4:<8}
{mask1:08b}  {mask2:<08b}  {mask3:<08b}  {mask4:<08b}''')

